app/views/subjects/index.html.erb

            <td>&#160;&#160;&#160;&#160;&#160;</td>
            <td><%=subject.pages.size%></td>
---
SELECT COUNT(*) FROM "pages" WHERE "pages"."subject_id" = $1  [["subject_id", 1]]