app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pages" SET "position" = $1, "subject_id" = $2, "updated_at" = $3 WHERE "pages"."id" = $4  [["position", 1000], ["subject_id", 7], ["updated_at", "2017-05-20 11:09:23.575160"], ["id", 1]]
---
  def update
    @page = Page.find(params[:id])

    if  @page.update_attributes(page_params)

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def delete
    @page = Page.find(params[:id])

INSERT INTO "pages" ("subject_id", "name", "permalink", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject_id", 7], ["name", "qwerty"], ["permalink", "Test"], ["position", 21], ["created_at", "2017-05-20 08:56:49.205823"], ["updated_at", "2017-05-20 08:56:49.205823"]]
---
  def create
    # Intanciate new Object


    @page = Page.new(page_params)

    # Save the Object
    if @page.save