app/controllers/sections_controller.rb

INSERT INTO "sections" ("page_id", "name", "position", "content_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["page_id", 6], ["name", "sasa"], ["position", 4], ["content_type", "asxsa"], ["created_at", "2017-05-20 12:50:29.947024"], ["updated_at", "2017-05-20 12:50:29.947024"]]
---
  def create
    @section = Section.new(section_params)

    if @section.save

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @section = Section.find(params[:id])

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sections" SET "position" = $1, "page_id" = $2, "updated_at" = $3 WHERE "sections"."id" = $4  [["position", 1000], ["page_id", 6], ["updated_at", "2017-05-20 23:10:19.534438"], ["id", 1]]
---
  def update
    @section = Section.find(params[:id])

    if @section.update_attributes(section_params)

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def delete
    @section = Section.find(params[:id])

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "sections" WHERE "sections"."id" = $1  [["id", 2]]
---
  def destroy
   @section = Section.find(params[:id])
   @section.destroy