app/controllers/subjects_controller.rb

  def create
    # Intanciate new Object
    @subject = Subject.new(subject_params)

    # Save the Object
    if @subject.save
---
INSERT INTO "subjects" ("name", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test 2"], ["position", 4], ["created_at", "2017-05-19 06:53:54.040009"], ["updated_at", "2017-05-19 06:53:54.040009"]]

  def update
  # Intanciate new Object
    @subject = Subject.find(params[:id])

    # Save the Object
    if @subject.update_attributes(subject_params)
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "subjects" SET "name" = $1, "position" = $2, "updated_at" = $3 WHERE "subjects"."id" = $4  [["name", "3rd subject"], ["position", 300], ["updated_at", "2017-05-19 07:29:45.457669"], ["id", 3]]

  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 1]]